In [6]:
import pandas as pd
import numpy as np

In [7]:
basic_df = pd.DataFrame({'first_col':[7,13,10,9,10,7,15],
                      'sec_col':[25,10,30,40,32,24,20],
                      'third_col':[12,65,47,3,4,4,12,]})
                      
basic_df

   first_col  sec_col  third_col
0          7       25         12
1         13       10         65
2         10       30         47
3          9       40          3
4         10       32          4
5          7       24          4
6         15       20         12

In [8]:
# default operations are column wise
basic_df.apply(np.mean)

first_col    10.142857
sec_col      25.857143
third_col    21.000000
dtype: float64

In [10]:
# To run an aggregate operation across a row, change the axis
basic_df.apply(np.mean, axis=1)

0    14.666667
1    29.333333
2    29.000000
3    17.333333
4    15.333333
5    11.666667
6    15.666667
dtype: float64

In [12]:
# Creating a new column and inserting a value, apply is taking the average of the row
basic_df['mean'] = basic_df.apply(np.mean,axis=1)
basic_df

   first_col  sec_col  third_col       mean
0          7       25         12  14.666667
1         13       10         65  29.333333
2         10       30         47  29.000000
3          9       40          3  17.333333
4         10       32          4  15.333333
5          7       24          4  11.666667
6         15       20         12  15.666667

In [13]:
# This will not work because there are not an equal number of columns
basic_df['col_mean'] = basic_df.apply(np.mean)
basic_df

   first_col  sec_col  third_col       mean  col_mean
0          7       25         12  14.666667       NaN
1         13       10         65  29.333333       NaN
2         10       30         47  29.000000       NaN
3          9       40          3  17.333333       NaN
4         10       32          4  15.333333       NaN
5          7       24          4  11.666667       NaN
6         15       20         12  15.666667       NaN

In [15]:
# If I want to look at individual elements, use map - applymap is the analogous function for series
basic_df['mean_bench'] = basic_df['mean'].map(lambda x: int(x))
basic_df

   first_col  sec_col  third_col       mean  col_mean  mean_bench
0          7       25         12  14.666667       NaN          14
1         13       10         65  29.333333       NaN          29
2         10       30         47  29.000000       NaN          29
3          9       40          3  17.333333       NaN          17
4         10       32          4  15.333333       NaN          15
5          7       24          4  11.666667       NaN          11
6         15       20         12  15.666667       NaN          15

In [31]:
basic_txt = pd.DataFrame({'first_col':['car','my car','junk bar'],
                           'sec_col':['lincoln','ford','mercury'],
                           'third_col':['Apollo 1', 'Apollo 11', 'Apollo 13']})
basic_txt

  first_col  sec_col  third_col
0       car  lincoln   Apollo 1
1    my car     ford  Apollo 11
2  junk bar  mercury  Apollo 13

In [32]:
basic_txt['car_search_map'] = basic_txt['first_col'].map(lambda x: x)
basic_txt

  first_col  sec_col  third_col car_search_map
0       car  lincoln   Apollo 1            car
1    my car     ford  Apollo 11         my car
2  junk bar  mercury  Apollo 13       junk bar

In [46]:
basic_txt['car_search_id'] = basic_txt['first_col'].map(lambda x: 'no' if x.find('car') < 0 else 'Yes')
basic_txt

  first_col  sec_col  third_col car_search_map car_search_id
0       car  lincoln   Apollo 1            car           Yes
1    my car     ford  Apollo 11         my car           Yes
2  junk bar  mercury  Apollo 13       junk bar            no